---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.SetRed(System.UInt32)
source: html/8b170c40-0661-ff1c-da39-eec1510bf7b5.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.SetRed Method

set red

## Syntax (C#)
```csharp
public void SetRed(
	uint red
)
```

## Parameters
- **red** (`System.UInt32`) - red

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - The value is not valid. The valid range is 0 to 255.